Revit 2027 API
BuiltInFailures.DetailFailures.RepeatingDetailSpacingZeroError Property
 Spacing must be greater than 0
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RepeatingDetailSpacingZeroError { get; }
Public Shared ReadOnly Property RepeatingDetailSpacingZeroError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RepeatingDetailSpacingZeroError {
	FailureDefinitionId^ get ();
}
static member RepeatingDetailSpacingZeroError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DetailFailures Class
Autodesk.Revit.DB Namespace